{
  "title": "Bedrock",
  "description": "Is there anyway for Fabric developers to write their Fabric Modding API and modding ability to new Android app by Fabric that will do the work just like Java Edition select Fabric profile. So when user opens android (Chromebook) version of Minecraft Fabric Launcher, it will have built-in Fabric Modding API and all other missing API stuff from java manually written in another language ported and injected into Minecraft Bedrock Edition on launcher startup. After that, of course mod developers who wants to support bedrock edition and to add cross-platform support for their mods must to re-write in other language their mods so that users will be able to add them into the launcher. But, if we have something called 'Java Compatibility Layer' into the Fabric Launcher app, that compatibility layer feature needs to be written to support cross-platform ability so that Java code and stuff will be translated to the language that the launcher supports on mod startup so that even when user try to put java fabric mod into the fabric launcher app, with that feature when user try to create a world and open it, while the world opening, the feature already translating java stuff into supported bedrock language and missing API stuff that is not available in Bedrock but available in Java that is important for mods to work property will be used not by Minecraft Bedrock, instead it will be used by Fabric Launcher app and the missing stuff in Bedrock will be fulfilled from that launcher and the modded game can be loaded successfully. Of course, that also means that there are so many work behind this and even separated source code for Android app version - so in short, for that launcher to exist Fabric needs a will to re-write only once Fabric Modloader to the Android app language that will be later used for all bedrock edition of Minecraft to all cross-platforms and with that, even Fabric will be able to earn money from that if you want - you will be remembered in the whole Minecraft history and first person ever that starts a new era for Bedrock Edition players - and that is Modding Era.",
  "color": "0xFFD700",
  "thumbnail": "https://cdn.discordapp.com/avatars/715181098035970149/a115e65fdf99f2da3d8d6a43632b38c2.webp?size=160"
}
